Revit 2027 API
SplineFailures Properties
The BuiltInFailures.SplineFailures type exposes the following members.
Properties
Name | Description
CannotCreateSpline |  Can't make Spline.
ClosedSpline |  Closed or self-intersecting splines are not allowed.
Top
See Also
Reference
BuiltInFailures.SplineFailures Class
Autodesk.Revit.DB Namespace